Revit 2027 API
FilterRule.ElementPasses Method
 Derived classes override this method to implement the test that determines whether the given element passes this rule or not.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool ElementPasses(
	Element element
)
Public Function ElementPasses (
	element As Element
) As Boolean
public:
bool ElementPasses(
	Element^ element
)
member ElementPasses :
        element : Element -> bool
Parameters
element Element
 The element to test against the rule.
Return Value
Boolean
 True if the element satisfies the rule, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
FilterRule Class
Autodesk.Revit.DB Namespace